In [2]:
import pandas as pd
import numpy as np


df = pd.DataFrame({'key':['A', 'B', 'C','A', 'B', 'C','A', 'B', 'C'],
                  
                  'data':[0, 5, 10, 5, 15, 20,10, 15, 20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    15
5   C    20
6   A    10
7   B    15
8   C    20

### groupby 基操

<img src="./pic/Snipaste_2023-05-09_09-40-19.jpg" width=300 height=300>

In [2]:
df.groupby('key').sum()

     data
key
A      15
B      35
C      50

In [3]:
df.groupby('key').aggregate(np.sum)

     data
key
A      15
B      35
C      50

In [4]:
df.groupby('key').aggregate(np.mean)

          data
key
A     5.000000
B    11.666667
C    16.666667

In [5]:
data = pd.read_csv('data/titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
data.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [7]:
data.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

### groupby 操作延伸

#### 一些属性的扩展

In [3]:
import pandas as pd

df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8),
                  })

df

     A      B         C         D
0  foo    one -0.040187 -0.456188
1  bar    one  1.312280 -0.767284
2  foo    two  1.604947 -2.103793
3  bar  three  0.237273 -0.976638
4  foo    two -0.442084 -0.110596
5  bar    two  0.274681  1.362957
6  foo    one  1.700253 -0.229810
7  foo  three -0.984289 -1.771753

In [5]:
grouped = df.groupby('A')
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [6]:
grouped = df.groupby(['A', 'B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [9]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'

grouped = df.groupby(get_letter_type, axis = 1)
grouped.count().iloc[0]

a    1
b    3
Name: 0, dtype: int64

In [14]:
s = pd.Series([1, 2, 3, 1,2,3], [8,7, 5, 8, 7, 5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [15]:
grouped = s.groupby(level = 0)
grouped.first()

5    3
7    2
8    1
dtype: int64

In [16]:
grouped.last()

5    3
7    2
8    1
dtype: int64

In [17]:
grouped.sum()

5    6
7    4
8    2
dtype: int64

In [18]:
grouped = s.groupby(level = 0, sort=False)
grouped.first()

8    1
7    2
5    3
dtype: int64

In [19]:
df2 = pd.DataFrame({'X': ['A', 'B', 'A', 'B'], 'Y': [1, 2, 3, 4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [20]:
df2.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  3

In [21]:
df2.groupby(['X']).get_group('B')

   X  Y
1  B  2
3  B  4

####  多重索引

In [25]:
arrays = [['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'], ['one', 'one', 'two', 'three','two', 'two', 'one', 'three']]

In [26]:
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

s = pd.Series(np.random.randn(8), index = index)
s

first  second
foo    one       0.434744
bar    one      -0.620777
foo    two      -0.808962
bar    three    -1.067798
foo    two       0.529562
bar    two      -1.300030
foo    one      -0.267831
       three     2.279891
dtype: float64

In [27]:
grouped = s.groupby(level=0)
grouped.sum()

first
bar   -2.988604
foo    2.167403
dtype: float64

In [28]:
grouped = s.groupby(level=1)
grouped.sum()

second
one     -0.453864
three    1.212094
two     -1.579431
dtype: float64

In [29]:
grouped = s.groupby(level='first')   # 用名字也行
grouped.sum()

first
bar   -2.988604
foo    2.167403
dtype: float64

In [30]:
grouped = df.groupby(['A', 'B'])
grouped.aggregate(np.sum)

                  C         D
A   B
bar one    0.050856 -1.033260
    three -1.555280  0.531300
    two    0.580190 -0.945862
foo one   -1.648852 -0.470907
    three -0.287470  0.718302
    two    0.311535 -1.111706

In [31]:
grouped = df.groupby(['A', 'B'], as_index=False)
grouped.aggregate(np.sum)

     A      B         C         D
0  bar    one  0.050856 -1.033260
1  bar  three -1.555280  0.531300
2  bar    two  0.580190 -0.945862
3  foo    one -1.648852 -0.470907
4  foo  three -0.287470  0.718302
5  foo    two  0.311535 -1.111706

In [32]:
df.groupby(['A', 'B']).sum().reset_index()

     A      B         C         D
0  bar    one  0.050856 -1.033260
1  bar  three -1.555280  0.531300
2  bar    two  0.580190 -0.945862
3  foo    one -1.648852 -0.470907
4  foo  three -0.287470  0.718302
5  foo    two  0.311535 -1.111706

In [33]:
grouped = df.groupby(['A', 'B'])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [34]:
grouped.describe().head()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  0.050856       NaN  0.050856  0.050856  0.050856  0.050856
    three   1.0 -1.555280       NaN -1.555280 -1.555280 -1.555280 -1.555280
    two     1.0  0.580190       NaN  0.580190  0.580190  0.580190  0.580190
foo one     2.0 -0.824426  0.435768 -1.132560 -0.978493 -0.824426 -0.670359
    three   1.0 -0.287470       NaN -0.287470 -0.287470 -0.287470 -0.287470

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    0.050856   1.0 -1.033260       NaN -1.033260 -1.033260 -1.033260
    three -1.555280   1.0  0.531300       NaN  0.531300  0.531300  0.531300
    two    0.580190   1.0 -0.945862       NaN -0.945862 -0.945862 -0.945862
foo one   -0.516292   2.0 -0.235453  0.321172 -0.462556 -0.349005 -0.235453
    three -0.287470   1.0  0.718302       NaN  0.718302  0.718302  0.718302


                75%       max
A   B
bar one   -1.033260 -1.033260
    three  0.531300  0.531300
    two   -0.945862 -0.945862
foo one   -0.121902 -0.008350
    three  0.718302  0.718302

In [35]:
grouped = df.groupby('A')
grouped['C'].agg([np.sum, np.mean, np.std])

          sum      mean       std
A
bar -0.924234 -0.308078  1.112062
foo -1.624786 -0.324957  0.583516

In [37]:
# grouped['C'].agg({'res_sum':np.sum, 'res_mean':np.mean, 'res_std':np.std})   版本问题

SpecificationError: nested renamer is not supported